test_app/app/controllers/accounts_controller.rb

INSERT INTO "account_registrations" ("updated_at", "account_id", "created_at") VALUES('2009-03-28 06:40:43', 1, '2009-03-28 06:40:43')
INSERT INTO "accounts" ("name", "updated_at", "created_at") VALUES('Nike', '2009-03-27 22:18:43', '2009-03-27 22:18:43')
---
def create
  @registration = AccountRegistration.new params[:account]
  if @registration.save