test_app/app/controllers/boats_controller.rb

  def update
    if @boat.update_attributes(params[:boat])
---
UPDATE "boats" SET "updated_at" = '2009-03-15 23:37:00', "name" = 'SS Minnow' WHERE "id" = 1

  def load_model
    @boat ||= Boat.find(params[:id])
---
SELECT * FROM "boats" WHERE ("boats"."id" = 1)